15232736765ylr
添加到主屏幕---

团队成员动画 关闭时 选择出来的成员没有删掉---

rotate fadeIn & fadeOut？？？

清明页面回顾：避免空值属性
<meta name=”format-detection” content=”telephone=no” />
数字电话号
<meta name=”apple-mobile-web-app-capable” content=”yes” />
菜单栏工具栏
<meta name=”apple-mobile-web-app-status-bar-style” content=”black|default|black-translucent” />
控制状态栏显示样式

var a =['s','s','d','f'],b=['1','3'];
for(var i = 0,l=a.length;i<l;i++){
if(parseInt(b[0]-1) == i){
	a[i]=a[i]+'checked';
	console.log(a[i]+i);
	b.shift();
}else{
	console.log(a[i]+i);
}
}

页面字体大小 rem

弹出窗口 的三角图形 ---

|| !!

实验--mobile web page 两边的留白

//////////////////////////////////
活动页面

v电影下载页

修改系列banner js
一个index取得值有误 

修改添加成员时关闭窗口时添加纪录的销毁


zepto1/5 prarllax 两个js库，想去读读源码，不然根本没办法写
那个示例网页目测还有个游戏脚本，感觉无力

baidu uediter--查看添加自定义按钮
知道在哪里定义，但是具体的事件函数还没有想好怎么写

/////////////////////////////////////////
prallax，zepto
目前来说只是了解了，没有大块的时间仔细研究

banner置顶动画特效
研究了几个其他的网站的例子
测试用js写还是css写，js不能实现背景颜色的转变，采用css3animate ie9+
对比vmovier 首页banner和内页的banner差别和共同点，需要修改的类名非常多，需要测试

活动页面的一些样式修改
时间地点分开
点击报名样式

添加提示对话框
初次尝试xm confirm插件，不兼容ie7
改为 artdialog，写法有差异，无奈又查了些文档

查了一下手机浏览器查找本地的app，等待验证

////////////////////////////

js读取键盘的上下左右

trello seo 新片场 img alt 
（修改截图里面的东西，可以再检测一下）

查了一下手机浏览器查找本地的app，等待验证XXXXXXXXXXXxx

banner置顶动画特效
研究了几个其他的网站的例子
测试用js写还是css写，js不能实现背景颜色的转变，采用css3animate ie9+
对比vmovier 首页banner和内页的banner差别和共同点，需要修改的类名非常多，需要测试
在主站的内页实现了转换，首页的样式比较繁琐
js也不是不能，就是需要再添加一个第三方的专用于背景色的转变

评论的前后断层，查找代码
在最初加载的时候提前删掉了loading，
filmplay。html commentloading（）
RL-pager.js

更换活动页面icon

活动页面的样式模板，用于后台发布文章使用
两个尺寸960 1180

//////////////////
修改系列banner定位导致的层叠上下文。

首页banner被下方的内容覆盖

ie7下css hack
z-index position opcaity
层叠关系与父级关系密切,福父级射不设置postion对自己的层叠权重有决定权

活动页面的slide按钮
活动页面表格
活动页面右侧的微播墙

zepto.js parallax

///////////////////
配置nodejs
zeptojs
活动时间地点
页码
正则要学习的
手机版活动站
半天，
今天完成活动站 pc问题
周三之前出活动版手机前端

banner置顶动画特效 js是否有漏洞

设置一个标志，鼠标没有操作的时候，不能出发scroll方法

新片场发送消息数字提示

之后接个人页面的设计
新片场
/////////////////////
完成活动站手机版页面

pc版 轮播 焦点

系列页面的滚动不加载
 研究Math
 matrix
 终于弄明白了那个页面是怎么实现的了，
 就是利用zepto的touch事件
 然后就是css3的动画属性
 结合到一起的，还以为多难

 ///////////
 Math 不是对象的类，没有构造函数，Math 的属性和方法都是简单的函数，而不是针对某个对象进行操作的方法。
 系统字体
 提交表单 样式
未读信息颜色加深
跳转页面的样式
手机版

正式写一下上下左右居中的demo

hango.js

////////////////////
视频浏览数

点击报名样式

自定义字体

今天的收获一定要写一篇文章
http://www.kankanews.com/ICkengine/categories/web/page/2
https://developers.google.com/chrome-developer-tools/docs/mobile-emulation?hl=zh-CN

按钮：hover

问题：怎么让页面变成一屏一屏的

////////////////////////////////
毕设文章编辑修改
手机动画demo


新片场 作品

扶持计划 1.2
活动分类

/////////////////////
毕设实现文章追加内容

mongodb 在linux & windows下的安装和启动

hover样式

git 本地分支


不断创新
数据展示 demo
新片场的搜索页面的标题样式，white-space：nowrap

ie8(Q)<meta http-equiv="X-UA-Compatible" content="edge" />

私信的字数限制


字体行高大号字和小号字
最佳电影评选

nodejs  get post

a onclick 如何在新标签页打开

///////////////////
毕设 ：首页显示书评人

在书籍内容页面显示本书的书评
给书评添加喜欢不喜欢（实现匿名）


////////////////////////
V电影 消息提醒样式和连接去掉

新片场 播放btn图片问题

///////////////////////
修改个人页面播放btn问题

V电影文章页面v电影推荐和关注我们换位置

手机分享btn添加动画特效

fixed关注我们 注意分辨率适配

banner 大小变化……


///////////
修改手机端分享样式不统一样式

fixed关注我们 重构，改变fix方法 right-left

tshirt页面样式
后续添加交互动画
/////////////////////
制作的大btn的位置v

悬浮btn 出现的时间和位置

遮罩层出现的动画

选择按钮的切换v

//////////////
圆梦计划，pc wap 添加团队

ios环境下 touch穿透，还没找到好的解决办法

系列板块 banner 第一个播放按钮

系列改版


、、、、、、、、、、

毕设的两个目标

1：实现连载的读取插入
2：书评人的个人页面
	TA想看的
	TA正在看的
	TA读过的
	TA上传过的书（连载 书籍）
	TA写过的书评(双向关联)
3:左侧的导航栏可以收起打开

将书评人的页面完成
	路由
	controller
	view

/////////////////////
最新连载：书籍中的正在看 看过 想看V 
		  // 阅读具体内容的时候，我可以写书评 动画
		  修改本页内容的权限限制
书评人：显示书评人的头像V
		//可以考虑是不是再添加一个二级评论
		评论的内容的具体显示
个人中心：用于查看个人信息 修改（放在下拉菜单中）
		  同时也显示个人页面需要显示的内容

图片压缩：

后台管理：

数据展示:

日志数据库

图片加载机制：？

将头像和书皮嵌套进相应数据表中V

待整理的问题：flash消息处理，错误消息处理，首页url 重定向URL

把当前的东西梳理好（前端）之后再考虑多加功能------
1:整合我上传的书到个人中心V
2:添加修改密码X。用户名禁止修改V
3:跑逻辑，将所有的网站逻辑跑顺畅

/////////////////////
抽象出共有控件
 组织代码结构

头图结构V
介绍文字排版V
页头和页脚排版V
分享连接V
logo标识V
块与块之间的间隔60px

头图尺寸///不是很需要具体头图的大小
导航tab
作品展示（纯展示性，展示性+点赞，展示性+点赞+订制）--有更多，无更多
活动流程图（四块，两块）--限定于用图
活动注意事项
参加活动BTN--之后的延伸页面不做抽象//图片还是代码
人物展示
组织机构展示

////////////////////

app动画

活动模板
/////////////////////
精彩点评

/////////////
sns：解决关注样式冲突

/*2014-10-27 星期一 10:37:45*/
1：新片场mobile
	评论--评论查看更多数据
		--回复评论时锚点定位
	个人页面
	统一icon
	统一字号
2：tower
3：javascript高级程序设计
	数据类型：boolean，Number，String，，，
4: html5 canvas for QQ animate
5: 学习一个css3的样式
6：一寸照片